Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: དེས་ཀྱང་བདག་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་གནང་གིས་དེར་ཁྱེད་ཀུན་གྱིས་ཀྱང་ལྷན་ཅིག་ཏུ་འཐུན་པ་དང་། ཡང་དག་པར་དགའ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། བསྙེན་བཀུར་ལ་བརྩོན་པར་གྱིས་ཤིག །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ལྷ་མ་ཡིན་གྱི་དབང་པོ་སྒྲ་གཅན་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་བདེ་མཆོག་དང་། ཚིམ་བྱེད་དང་། ཐགས་ཟངས་རིས་ལ་སྨྲས་པ།
en: Out of his love for me, he accepted. Thus, all of you must harmoniously and joyfully endeavor to venerate and serve the Thus-Gone One.” Nāga King Sāgara told the asura lords Rāhu, Supreme Bliss, Satisfier, and Vemacitrin:

source: གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་ཆེན་པོ་འདིར་གཤེགས་ཀྱིས།
en: “Friends, take notice! The Thus-Gone One plans to come to this ocean.

source: དེར་ཁྱེད་འཁོར་དང་བཅས་པ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་བདག་གི་སྐབས་ཕྱེ་བ་ལགས་ཀྱིས།
en: I have created the opportunity for you, along with all your retinues, to venerate the Blessed One. Come to my abode!”

source: བདག་གི་གནས་སུ་སྤྱོན་ཅིག །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས། ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་དང་། ཁ་དོག་མཐའ་ཡས་དང་། དྲི་མ་མེད་པ་དང་། འོད་ཅན་དང་། རྣམ་པར་རྩེ་དང་། བཀོད་པ་དང་། ལག་ན་རྡོ་རྗེ་དང་། བརྗོད་བྱ་དང་། ཁ་དོག་ཐམས་ཅད་སྟོན་པ་དང་། ཙན་དན་གྱི་རྣམ་པ་དང་། དེ་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་འབུམ་ཕྲག་དུ་མ་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཁྱེད་ཅག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བདག་གི་གནས་སུ་སྤྱོན་ཅིག །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་གཞོན་ནུ་དཔལ་གྱི་གཟི་བརྗིད་ལ་བསྒོ་བ།
en: Nāga King Sāgara then addressed the nāga kings Takṣaka, Infinite Color, Immaculate , Light , Playful , Array , Vajrapāṇi, Expressed , Displaying All Colors, Varieties of Sandalwood, and hundreds of thousands of other nāga kings, “Friends, you all must come to my abode to behold, prostrate to, and serve the Thus-Gone One.”

source: བཞིན་བཟངས་ཁྱོད་སོང་ལ།
en: Nāga King Sāgara then commanded the prince Glorious Splendor, “Your Highness, go forth.

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚོལ་ལ།
en: Prostrate your head to the feet of the Nāga King Anavatapta and deliver my message.

source: ངའི་ཕྲིན་འདི་སྐད་ཅེས་གྱིས་ཤིག །བདག་གི་ཕའི་མཆིད་ནས་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཤོས་གསོལ་གྱིས་རྒྱ་མཚོ་ཆེན་པོར་སྤྱོན་ཅིག་ཅེས་གྱིས་ཤིག །ལེགས་སོ་ཞེས་བྱས་ཏེ་མཉན་ནས།
en: Tell him to come here to this ocean, because at your father’s request, the Blessed One, the perfect Buddha, is coming here to have his meal.”

source: ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱིས་བྱས་སོ།
en: “As you wish,” the prince said. And so Nāga King Sāgara’s son Glorious Splendor did just as he was told.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས། ཀླུའི་རྒྱལ་པོ་ཤུགས་དྲག་ལ་སྨྲས་པ། ཤུགས་དྲག་ཁྱོད་སོང་ལ་རི་རབ་ཀྱི་སྟེང་དུ་སོང་སྟེ།
en: Nāga King Sāgara then said to Nāga King Fierce Strength, “Fierce Strength, get going.

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་གཉིས་ཀྱང་བོས་ཤིག །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། བསྙེན་བཀུར་གྱིས་རྒྱ་མཚོ་ཆེན་པོར་བདག་གི་གནས་སུ་སྤྱོན་ཅིག་ཅེས་གྱིས་ཤིག །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་ཤུགས་དྲག་ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་གཉིས་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་ཐད་དུ་སོང་ནས།
en: Go to the top of Mount Meru and call upon both Nāga King Nanda and Nāga King Upananda. Also tell Śakra, lord of the gods, to come to my abode to venerate and serve the Thus-Gone One.” Nāga King Sāgara’s son Fierce Strength then did as he was told and went before both Nāga King Nanda and Nāga King Upananda and Śakra, lord of the gods.

source: ཇི་སྐད་བསྒོ་བ་བཞིན་དུ་བོས་སོ།
en: He called on them just as he was instructed.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་རང་གི་གནས་སུ་འཁོར་གྱི་ཁྱམས་བཀོད་པ་བཻ་དཱུརྱ་སྔོན་པོ་དག་དང་། འཛམ་བུ་ཆུ་བོའི་གསེར་ལས་བྱས་པ་བཤམས་ཏེ། རིན་པོ་ཆེ་དུ་མས་ནི་སྤྲས།
en: Nāga King Sāgara then set up the courtyard in his abode with blue beryl and gold from the Jambū river.

source: རིན་པོ་ཆེའི་དྲ་བས་ནི་ཁེབས་པར་བྱས། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་ནི་དཔྱངས། དར་གྱི་ལྡ་ལྡི་མང་པོ་ནི་བཏགས། བླ་རེ་ནི་བྲེས། རྒྱལ་མཚན་དང་བ་དན་ནི་བསྒྲེང་།
en: He beautified it with various gems, covered it with a net of jewels, hung up a net of tiny bells, attached many silken tassels, erected a canopy, planted banners and pennants, fumigated the space with the ocean’s finest incense, and scattered various flowers.

source: རྒྱ་མཚོའི་སྤོས་ཀྱི་མཆོག་གིས་ནི་བདུགས། མེ་ཏོག་སྣ་ཚོགས་ནི་བཀྲམ་སྟེ། འཁོར་གྱི་ཁྱམས་ཡངས་ཤིང་རྒྱ་ཆེ་བ་དེའི་ནང་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སེང་གེའི་ཁྲི་འཕང་དུ་དཔག་ཚད་བཅུ་གཉིས་པ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ།
en: In the wide and vast courtyard, he set up a lion throne twelve leagues in height, set with various jewels, and laid with various fabrics of divine linen.

source: ལྷ་རྫས་ཀྱི་རས་བཅོས་བུ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་མང་པོ་བཏིང་བ་བླ་རེས་བྲེས་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུས་བསྐོར་བ། རིན་པོ་ཆེའི་དྲ་བས་ཁེབས་པ། དྲིལ་བུ་གཡེར་ཁའི་དྲ་བ་དཔྱངས་པ། དར་གྱི་ལྡ་ལྡི་བཏགས་པས་བརྒྱན་པ། རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་ཞིག་བཤམས་སོ།
en: Above this he erected a canopy and surrounded it with an offering shrine made of the seven precious materials, decorating it by festooning it with a net of jewels, suspending from it a network of tiny bells, and attaching to it silken tassels, thus creating an arrangement that was the finest in all respects.

source: །དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ཀྱི་གདན་ཡང་ཇི་ལྟར་འཚམ་པ་བཞིན་དུ་བཤམས་སོ། །རོ་བརྒྱས་བསྒོས་པའི་ཞལ་ཟས་དག་ཀྱང་བཤམས་ཏེ།
en: He set out appropriate seats for the monastic saṅgha and food of many flavors.

source: ཐམས་ཅད་ལེགས་པར་ཟིན་པར་རིག་ནས་བུ་དང་གཉེན་འདབ་དང་འཁོར་དང་བཅས་ཏེ། རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་བང་རིམ་ལ་འཁོད་ནས། བཅོམ་ལྡན་འདས་ལ་གདུགས་ཚོད་བབ་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ།
en: Seeing that everything was well prepared, with his sons, relatives, and retinue arrayed on the terraces of Mount Meru, the king of mountains, he spoke these verses when the time had come for the Blessed One’s midday meal:

source: །ཆོས་ཀྱི་དབང་ཕྱུག་ཡེ་ཤེས་རྒྱ་ཆེན་ཁྱེད་བརྙེས་པ།
en: “O Lord of Dharma, you have realized vast wisdom—

source: །ཡེ་ཤེས་འབྱུང་གནས་མཁའ་འདྲ་ཡེ་ཤེས་མཐའ་ཡས་པ།
en: Infinite wisdom, a sky-like source of wisdom.

source: །འཇིག་རྟེན་འདས་པ་སྤྱན་ཡངས་དག་པའི་སྤྱན་དང་ལྡན།
en: Being beyond the world, you have liberated eyes and eyes of purity.

source: །ཕན་པ་མཛད་པ་གདུགས་ཚོད་བབ་ཀྱིས་གཤེགས་སུ་གསོལ།
en: O benefactor, the midday meal is set. Please come forth!

source: །ཚངས་པའི་གསུང་དང་རྣམ་དག་གསུང་ལྡན་དབྱངས་སྙན་པ།
en: “Your pleasant voice is pure speech—the speech of Brahmā!

source: །ཀ་ལ་པིང་ཀའི་རྔ་སྒྲ་བདུད་རྩིའི་དོན་སྟོན་པ།
en: With beauty like the call of the kalaviṅka or a drum, you teach the ambrosial meaning.

source: །སྨན་པའི་མཆོག་སྟེ་ཉོན་མོངས་སྣ་ཚོགས་མུན་སེལ་བ།
en: It is the supreme medicine, dispelling the darkness of various afflictions.

source: །སེམས་ཅན་རིན་ཆེན་གདུགས་ཚོད་བབ་ཀྱིས་གཤེགས་སུ་གསོལ།
en: O jewel of beings, your midday meal is set. Please come forth!

source: །ཞི་ཞིང་རབ་ཞི་ཐུགས་མངའ་རྟག་ཏུ་ཞི་བར་སྤྱོད།
en: “Your mind is peaceful, utterly peaceful, and you always act calmly.

source: །རྒྱལ་བ་གྲོལ་བ་ལྷ་དང་མི་རྣམས་རབ་གྲོལ་མཛད།
en: O liberated victor, you liberate gods and humans.

source: །ཆུ་བོ་བཞི་ལས་རྒལ་བ་འགྲོ་བ་སྒྲོལ་བ་པོ།
en: Having crossed the four rivers of suffering, you are the liberator.

source: །ཕ་རོལ་གཤེགས་པ་བདེ་སྦྱིན་གདུགས་ཚོད་དུས་ལ་བབ།
en: Transcendent one who makes others happy, the time for your midday meal has come!

source: །སྦྱིན་དུལ་ཡང་དག་སྡོམ་དགྱེས་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག །བཟོད་པའི་སྟོབས་དང་ལྡན་ཞིང་བརྩོན་འགྲུས་ཆེན་པོ་བརྙེས།
en: “You master generosity, gentleness, pure vows, joy, and pure discipline. You have the power of patience and great diligence.

source: །བསམ་གཏན་རྣམ་ཐར་དགྱེས་པ་ཤེས་རབ་ཡོངས་སུ་རྫོགས།
en: You are joyful with the concentrations and freedoms and have perfect insight.

source: །ཞལ་རས་ཟླ་འདྲ་གདུགས་ཚོད་བབ་ཀྱིས་གཤེགས་སུ་གསོལ།
en: O you with a moon-like visage, your midday meal is set. Please come forth!

source: །ལམ་མཁྱེན་ལམ་ལ་མཁས་ཤིང་ལམ་སྲང་ངན་པ་སྤངས།
en: “You know and master the path, having abandoned the paths that lead to ruin.

source: །བྱང་ཆུབ་ཡན་ལག་དབང་སྟོབས་བདེན་པ་བཞི་སྟོན་པ།
en: With the branches of awakening, faculties, and strengths , you teach the four truths.

source: །ཡང་དག་སྤོང་དང་རྫུ་འཕྲུལ་བཞི་དྲན་དང་ལྡན་པ།
en: You master the correct abandonments, the four bases of miraculous absorption, and mindfulness.

source: །ཐམས་ཅད་ཟིལ་གནོན་ཡོན་ཏན་མངའ་བ་གདུགས་ཚོད་བབ།
en: You who outshine everyone with the mastery of qualities—your midday meal is set.

source: །སུམ་ཅུ་རྩ་གཉིས་མཚན་མངའ་བསོད་ནམས་བརྒྱ་ཡི་ཏོག །བསོད་ནམས་འཚལ་རྣམས་བསོད་ནམས་ཞིང་ཆེན་བཅོམ་ལྡན་འདས།
en: “Possessing the thirty-two marks, with the crest of myriad merits, Blessed One, you are a great merit field for those who desire merit.

source: །མཆོད་སྦྱིན་དམ་པ་བཞེས་པའི་འོས་ལགས་ཡོན་གྱི་གནས།
en: You are the recipient of offerings, worthy to accept sublime gifts of worship.

source: །བྱམས་ལ་དགྱེས་པ་གདུགས་ཚོད་བབ་ཀྱིས་གཤེགས་སུ་གསོལ།
en: Loving and joyful one, your midday meal is set. Please come forth.

source: །ལྷུན་པོ་འདྲ་ཞིང་ས་དང་མཚུངས་ལ་སྦྱོར་བ་སྙོམས།
en: “You are like Sumeru, like the earth, and you equalize all endeavors.

source: །བྱམས་སྡང་མི་མངའ་ནམ་མཁའི་ངོ་བོ་ཉིད་དང་མཚུངས།
en: Like the essential nature of space, you hold neither anger nor love.

source: །མི་ཡི་དབང་པོ་ཁེངས་པ་མི་མངའ་དམན་མི་མངའ།
en: Lord of Humans, you are beyond both arrogance and lowliness.

source: །སྟོང་དང་རྣམ་པར་ཐར་ལ་དགྱེས་པ་གདུགས་ཚོད་བབ།
en: O you who delight in emptiness and freedom, your midday meal is set.

source: །ཀུན་མཁྱེན་ཀུན་ལ་མཁས་པ་དུས་དང་ཆོ་ག་མཁྱེན།
en: “Omniscient, all-knowing one, you know the rites and their proper times,

source: །ཆོས་རྣམས་དབྱེ་ལ་མཁས་པ་རྟག་ཏུ་དུལ་བཞིན་སྤྱོད།
en: You know the divisions of the teachings, your behavior is always properly disciplined,

source: །སེམས་ཅན་བསམ་པ་རབ་མཁྱེན་དོན་རིག་མཁྱེན་པར་ལྡན།
en: You know the wishes of beings, and you know what benefits them.

source: །ཆོས་ཀྱི་ངོ་བོ་ཉིད་མཁྱེན་གདུགས་ཚོད་དུས་ལ་བབ།
en: Knower of the essential nature of phenomena, your midday meal is set.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་གདུགས་ཚོད་བབ་པ་དེ་ཐུགས་སུ་ཆུད་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One, knowing that Nāga King Sāgara had set the midday meal, addressed his monks, “Monks, Nāga King Sāgara has set the midday meal.

source: དགེ་སློང་དག་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་གདུགས་ཚོད་བབ་ཀྱིས་ལྷུང་བཟེད་དང་ཆོས་གོས་ལོང་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ཡོངས་སུ་ལོངས་སྤྱད་པའི་ཕྱིར་རྒྱ་མཚོ་ཆེན་པོར་འདོང་ངོ་།
en: So take up your alms bowls and monastic robes and come with me to the ocean in order to ripen beings and make use of the Nāga King Sāgara’s abode.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར། ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར། ལྷའི་ཚོགས་ཀྱིས་ནི་ཕྱག་བྱས། ལྷ་མ་ཡིན་གྱི་ཚོགས་ཀྱིས་ནི་བསྟོད་དེ། ངང་པའི་རྒྱལ་པོ་བཞིན་དུ་སྟེང་གི་བར་སྣང་ལ་འཕགས་ཏེ།
en: Then the Blessed One, surrounded by his assembly of bodhisattvas, venerated by the saṅgha of hearers, honored by the assembly of gods, and praised by the assembly of asuras, rose into the sky like the king of swans.

source: གཤེགས་ནས་འོད་ཟེར་ནི་འགྱེད་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ནི་སྣང་བར་མཛད། པད་མའི་ཆར་ནི་འབེབས། སིལ་སྙན་འབུམ་ནི་སྒྲོགས། གླུ་དབྱངས་འབུམ་ནི་གྲགས་པར་མཛད་དེ།
en: As he traveled, rays of light radiated out, filling buddha realms with light, causing a rain of lotuses, playing myriad instruments, and causing the resounding of myriad songs.

source: རྒྱ་མཚོའི་འགྲམ་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་རྒྱ་མཚོའི་འགྲམ་ན་དགའ་བའི་ཚལ་ལྟར་ཉམས་དགའ་བ་ཞེས་བྱ་བའི་ཙམ་པ་ཀའི་ཚལ་ག་ལ་བ་དེར་གཤེགས་སོ།
en: They traveled to the shores of the ocean to a magnolia forest called Joyful , which was like a pleasure grove.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱས་སོ།
en: Nāga King Sāgara went to the Blessed One, bowed his head to the Blessed One’s feet, and venerated him.

source: །མཆོད་པ་བྱས་ནས་གདུགས་ཚོད་ཕབ་བོ།
en: Having paid his respects, he set the midday meal.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་འདི་སྙམ་དུ་སེམས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱིས་བདག་གི་གནས་སུ་གཤེགས་པ་དེ་ནི་བདག་གིས་རིག་པ་མ་ཡིན།
en: Nāga King Sāgara then thought, “I am not sure whether the Blessed One can come to my abode through his magical powers.

source: ཆ་མ་ཡིན་གྱིས། བདག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ཐེམ་སྐས་ཇི་ལྟ་བུ་དག་གིས་བཅོམ་ལྡན་འདས་སུམ་ཅུ་རྩ་གསུམ་གྱི་གནས་ནས་འཛམ་བུ་གླིང་དུ་གཤེགས་པ་དེ་ཁོ་ན་ལྟ་བུའི་ཐེམ་སྐས་དག་བྱིན་གྱིས་བརླབས་ལ།
en: So in order to venerate the Blessed One, I will bless a set of stairs to function just like the stairway the Blessed One used to come from the Heaven of the Thirty-Three to Jambudvīpa.

source: ཐེམ་སྐས་དེ་དག་ལས་བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: Certainly, the Blessed One can descend into the ocean down such stairs.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་རྒྱ་མཚོ་ཆེན་པོའི་འགྲམ་ནས། རང་གི་གནས་ཀྱི་བར་དུ་ཐེམ་སྐས་ཀྱི་རིམ་པ་གསུམ་བཤམས་ཏེ།
en: Nāga King Sāgara then set up a three-level staircase between the banks of the ocean and his own abode.

source: གཅིག་ནི་གསེར་ལས་བྱས། གཅིག་ནི་བཻ་དཱུརྱ་ལས་བྱས། གཅིག་ནི་མུ་ཏིག་དམར་པོ་ལས་བྱས་ཏེ།
en: One level was made of gold, one of beryl, and one of red pearl.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་སྤྲས་པ། བཀྲ་བ་བལྟ་ན་སྡུག་པ་དག་བཤམས་སོ།
en: They were decorated with all manner of jewels and were brilliant and beautiful to behold.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་རྒྱ་མཚོ་ཆེན་པོའི་ཆུའི་ཕུང་པོ་སུས་ཀྱང་མིག་གིས་མ་མཐོང་བ་དང་། ཆུས་ཀྱང་སེམས་ཅན་དག་ལ་གནོད་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་བརླབས་སོ།
en: The Blessed One then blessed the mass of water in the ocean so that it became invisible and would not harm any being.

source: །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལས་ཀྱང་འོད་གང་གིས་རྒྱ་མཚོ་ཆེན་པོ་སྣང་བར་གྱུར་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་འོད་འགྱེད་པར་མཛད་དོ།
en: Next, light from the Blessed One’s body illuminated the ocean as when light spreads out to illuminate the worlds of the great trichiliocosm.

source: །རྒྱ་མཚོ་ཆེན་པོ་ན་སེམས་ཅན་གནས་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་འོད་དེས་རེག་པ་ཙམ་གྱིས་བྱམས་པའི་སེམས་དང་། ཕན་པའི་སེམས་དང་། མཉེན་པའི་སེམས་དང་། བདེ་བའི་སེམས་སུ་གྱུར་ཏེ།
en: Every being in the ocean who was merely touched by this light adopted a loving, altruistic, friendly, and happy attitude.

source: ཕྱིན་ཅད་སུ་ཡང་ཕན་ཚུན་རྣམ་པར་འཚེ་བ་མེད་ཅིང་གནོད་པ་བྱེད་པ་མེད་དེ།
en: Henceforth none of them harbored malice or harmfulness toward one another.

source: དེ་དག་ཐམས་ཅད་གཅིག་ལ་གཅིག་ཕ་མར་འདུ་ཤེས་པར་གྱུར་ཏོ།
en: Instead they all had the perception of one another as parents.

source: །འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱང་ཆོས་མཉན་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་གནས་ཀྱི་བཀོད་པ་བལྟ་བར་འདོད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་ཕྱིར་བཞིན་འབྲང་ངོ་།
en: Gods of the desire and form realms followed behind the Blessed One because they yearned to hear the Dharma and to witness the features of the Nāga King Sāgara’s abode.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་དགའ་བའི་ཚལ་ལྟར་ཉམས་དགའ་བའི་ཙམ་པ་ཀའི་ཚལ་ནས་ལངས་ཏེ། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཐེམ་སྐས་ཀྱི་རིམ་པ་བཤམས་པ་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས།
en: Then the Blessed One, along with the bodhisattvas, the great hearers, Śakra, Brahmā, and other world protectors, along with gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans left the park-like magnolia forest and descended the staircase erected by Nāga King Sāgara.

source: ཐེམ་སྐས་དབུས་མ་ལ་ནི་བཅོམ་ལྡན་འདས་བཞུགས་སོ། །གཡས་རོལ་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཁོད་དོ། །གཡོན་རོལ་ན་ནི་ཉན་ཐོས་ཆེན་པོ་རྣམས་འཁོད་དོ། །མདུན་ལོགས་ན་ནི་བརྒྱ་བྱིན་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ལག་པ་གཡས་པས་ལམ་མཚོན་པར་བྱེད་དོ།
en: The Blessed One stood in the center with the bodhisattvas arrayed on his right, the great hearers arrayed on his left, and six hundred million śakras before him, pointing out the path with their right hands.

source: །ཚངས་པ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དོ། །བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་གདུགས་རྣམས་འཛིན་ཏོ།
en: Six hundred million brahmās were arrayed in the sky above, shading the Blessed One with jeweled parasols.

source: །ལྷ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྣམ་ལོགས་ན་འཁོད་དེ། མེ་ཏོག་གི་ཆར་འབེབས་སོ།
en: Six hundred million gods were arrayed behind the Blessed One, tossing a rain of flowers.

source: །འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ནི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་སིལ་སྙན་བྱེ་བ་ཕྲག་དྲུག་ཅུ་དཀྲོལ་བར་བྱེད་དོ།
en: Gods of the desire realm played six hundred million instruments in order to venerate the Blessed One.

source: །ལྷའི་བུ་མོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་ཤུལ་སྤོས་ཆུས་ཆག་ཆག་འདེབས་སོ།
en: Six hundred million goddesses anointed the Blessed One’s tracks with scented water.

source: །ཀླུའི་བུ་མོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དེ། རོ་སྟོད་ཁེབས་པའི་མུ་ཏིག་གི་ཕྲེང་བ་དག་འཕྱང་བར་བྱེད་དོ།
en: Six hundred million female nāgas were arrayed in the sky with garlands of pearl draped over their upper torsos.

source: །མིའམ་ཅི་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་བརྗོད་པས་སྟོད་པར་བྱེད་དོ།
en: Six hundred million kinnaras uttered verses of praise to the Blessed One.

source: །དྲི་ཟ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན། མེ་ཏོག་གི་ཕྲེང་བ་རྣམས་འཕྱང་བར་བྱེད་དོ།
en: Six hundred million gandharvas draped flower garlands before the Blessed One.

source: །ལྷ་མ་ཡིན་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ནི་རས་བཅོས་བུ་ཁ་དོག་སྣ་ཚོགས་སྟོང་གིས་བཅོམ་ལྡན་འདས་ལ་འགེབས་པར་བྱེད་དོ།
en: Six hundred million asuras draped the Blessed One with fine linens of many colors.

source: །ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ཡང་འཁོར་བྱེ་བ་ཕྲག་བརྒྱ་ནམ་མཁའི་དཀྱིལ་ན་འཁོད་དེ། མེ་ཏོག་དང་། སྤོས་དང་། ཕྱེ་མ་དང་། བྱུག་པ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐམས་ཅད་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་དང་། ཕེག་རྡོབ་པ་དང་། ལྷའི་བཀོད་པ་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་དེ།
en: Nāga King Anavatapta was also in the sky above with hundreds of millions of his retinue venerating the Blessed One with flowers, incense, powders, ointments, garments, parasols, banners, pennants, instruments, songs, cymbals, and divine adornments.

source: དེ་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་དྲུག་ཁྲི་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱེད་པ་ལ་ཞུགས་སོ།
en: Sixty thousand other nāga kings were engaged in venerating the Blessed One.

source: །དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་ཏུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། །བྱང་ཆུབ་སེམས་དཔའ་མཐུ་ཆེན་ཐོབ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་མང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དགའ་བར་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷགས་སོ། །དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་ལ།
en: The bodhisattvas Avalokiteśvara and Mahāsthāmaprāpta, along with hundreds of billions of bodhisattvas in their retinue, also came from the Thus-Gone One Amitāyus’ buddha realm Sukhāvatī to gladden Nāga King Sāgara and venerate the Blessed One.

source: མཆོད་པའི་བཀོད་པ་སྔ་མ་གང་ཡིན་པ་དེ་མོག་མོག་པོར་བྱེད་ཅིང་མི་མངོན་པར་བྱེད་པ་དེ་ལྟ་བུ་མཆོད་པ་བྱས་སོ།
en: They even eclipsed the previous array of offerings made to the Blessed One, venerating him such that the former offerings seemed to disappear.

source: །དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བཟོད་དཀའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འོད་ཀྱི་ཏོག་དང་། འོད་ཀྱི་དཔལ་གཉིས་འོངས་སོ།
en: Likewise, the two bodhisattvas, Crest of Light and Splendor of Light, came from the Blessed Thus-Gone One Difficult to Bear’s buddha realm called Light Rays

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མངོན་དགའ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སྤོས་ཀྱི་གླང་པོ་དང་། གླང་ཆེན་སྤོས་ཀྱི་གླང་པོ་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Gandhahastin and Giant Incense Elephant from the Blessed Thus-Gone One Akṣobhya’s buddha realm called Abhirati.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཉི་ཟླའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་བྱེད་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེ་དང་། སེང་གེའི་བློ་གྲོས་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Siṃha and Siṃhamati from the Blessed Thus-Gone One Candrasūrya’s buddha realm called Fully Illuminating.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྤྱན་བཟངས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མིག་མི་འཛུམས་པ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ལོ་སྒྱུར་བ་དང་། ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པ་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Sārathi and Mastery over All Phenomena from the Blessed Thus-Gone One Fine Eyes’ buddha realm called Unblinking Eye.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཅན་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་དཀྱིལ་འཁོར་ཅན་དང་། རིན་ཆེན་ཏ་ལ་ལ་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Jeweled Maṇḍala and Jeweled Palm Tree from the Blessed Thus-Gone One Illuminator ’s buddha realm called Light

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་དཔལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་དགའ་བའི་སྙིང་པོ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་མཐོང་བ་དོན་ཡོད་དང་། རྣམ་པར་གནོན་པ་དོན་ཡོད་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Amoghadarśin and Meaningful Subjugator from the Blessed Thus-Gone One Ratnaśrī ’s buddha realm called Heart of Joy.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་པར་གཟིགས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་ཏུ་ལྟ་བ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་གྱི་རྒྱལ་པོ་དང་། ཆོས་ཀྱི་རྒྱལ་པོ་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Cloud King and Dharmarāja from the Blessed Thus-Gone One Samantavipaśyin’s buddha realm called All-Seeing.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་ན་དགའ་བ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རབ་ཏུ་འཇོམས་པ་དང་། བྲག་འཇོམས་རྒྱལ་པོ་གཉིས་འོངས་སོ།
en: Next arrived the two bodhisattvas Mārapramardaka and Rock-Defeating King from the Blessed Thus-Gone One King of the World ’s buddha realm called Priyadarśana.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཏོག་གི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་ལྡན་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རབ་གནས་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་གཉིས་འོངས་སོ།
en: Lastly arrived the two bodhisattvas Grounded in Intelligence and Sarvanīvaraṇaviṣkambhin from the Blessed Thus-Gone One Ratnaketu’s buddha realm called Ratnavatī.

source: །དེ་ལྟར་ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་བྱེ་བ་མང་པོ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དགའ་བར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་ལྷགས་སོ།
en: In this manner hundreds of billions of bodhisattvas came from the ten directions to gladden Nāga King Sāgara and venerate the Thus-Gone One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སངས་རྒྱས་ཀྱི་མཐུ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་བཀོད་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་བདག་ཉིད་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་མཆོད་པ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་སེང་གེའི་སྒྲ་ཆེན་པོས་ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཞིང་དཔག་ཏུ་མེད་པ་དག་འོད་ཀྱིས་ཁྱབ་པར་མཛད་དེ། སངས་རྒྱས་ཀྱི་གསུང་གིས་གོ་བར་མཛད་ནས།
en: Then, through the tremendous power, magical ability, miraculous power, array, greatness, display, veneration, and lion’s roar of the buddhas, the Blessed One flooded countless buddha realms throughout the ten directions with light and made his buddha speech heard.

source: ལྷ་འབུམ་གྱིས་སིལ་སྙན་དང་། གླུ་དབྱངས་ལེན་ཅིང་མེ་ཏོག་གི་ཆར་འབེབས་ལ།
en: A hundred thousand gods played instruments, sang songs, and cast a rain of flowers.

source: ངན་སོང་ཐམས་ཅད་ཀྱི་འཆི་འཕོ་དང་སྐྱེ་བ་རབ་ཏུ་ཞི་བར་བྱས་ཏེ།
en: All death and rebirth into the lower realms was quelled.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་དང་། ཡིད་བདེ་བ་བསྒྲུབས་ནས་སྙིང་རྗེ་ཆེན་པོ་བརྟན་པ་ཞེས་བྱ་བའི་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: All beings were established in happiness and joy and entered into an awakened absorption called stability in great compassion

source: །བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལྟ་བུས་རིན་པོ་ཆེའི་ཐེམ་སྐས་དེ་དག་ལས་རྒྱ་མཚོ་ཆེན་པོར་གཤེགས་ཏེ།
en: Amidst this unfathomable display, he then descended the jeweled staircases into the ocean.
